# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.


max = 0

for x in range(5):
    number = int(input('Введите число: '))
    if (number > max:
        max = number
print(f'Максимальное число: {max}')